// experiment2-3.cpp : 此檔案包含 'main' 函式。程式會於該處開始執行及結束執行。
//

#include <iostream>
using namespace std;
int main() {
	float x, y, z;//定義三邊長
	cout << "enter numbers" << endl;
	cin >> x >> y >> z;
	if ((x+y>=z)&&(x+z>=y)&&(y+z>=x)) {//判斷三角形成立條件
		if ((x == y) || (x == z) || (y == z) || ((x == y) && (x == z) && (y == z))) {//判斷是不是等腰三角形 
			cout << "是等腰三角形" << endl;
		}
		else {
			cout << "非等腰三角形" << endl;
		}
	}
	else {
		cout << "非三角形" << endl;
	}

	return 0;
}

// 執行程式: Ctrl + F5 或 [偵錯] > [啟動但不偵錯] 功能表
// 偵錯程式: F5 或 [偵錯] > [啟動偵錯] 功能表

// 開始使用的提示: 
//   1. 使用 [方案總管] 視窗，新增/管理檔案
//   2. 使用 [Team Explorer] 視窗，連線到原始檔控制
//   3. 使用 [輸出] 視窗，參閱組建輸出與其他訊息
//   4. 使用 [錯誤清單] 視窗，檢視錯誤
//   5. 前往 [專案] > [新增項目]，建立新的程式碼檔案，或是前往 [專案] > [新增現有項目]，將現有程式碼檔案新增至專案
//   6. 之後要再次開啟此專案時，請前往 [檔案] > [開啟] > [專案]，然後選取 .sln 檔案
